{
    "brief": "Yet, the reality was very different. In her HR role, Bonny conveyed that Kristina had recommended me for the job. Skepticism arose when I discovered Kristina had used the WhatsApp alias “Ava.” To address my doubts, Bonny presented a screenshot of her chat with Ava (or Kristina), leading to an unforeseen twist. Shortly afterward, Bonny presented me with the so-called job, which was, in reality, the scam. Following the process, I sent her a screenshot as directed and already had 20 USDT in my digital wallet to kickstart my work. She then gave instructions for a straightforward process: My main task was to activate the work wizard by choosing “Launch Evolution” and clicking “Evolve” for the listed apps. The Illusion of Executive Applications She informed me that she would withdraw the entire balance from the training account, which she had financed. To continue working, I had to contact customer service and provide my training account’s username. Bonny even disclosed her daily earnings, fostering a sense of camaraderie. During my engagement, Bonny took on various roles. In addition, I changed the withdrawal wallet address to my own before Bonny had the opportunity to empty the training account. And everything Bonny had shown me was fake, with not a single dollar ever being transferred during my training. The crucial factor is in the training phase, where the guide convincingly shows that the system not only works but also brings in profits. What’s interesting about this psychological manipulation is that it not only gives the illusion of making money but also triggers a surge of positive emotions. If you approach the scam with skepticism, it’s easy to lose that doubt during the training and start believing that it works. That’s exactly what the scammers want—to make you believe in the illusion of success, prompting you to deposit money into your account and unintentionally lose it. But for those who have fallen into this or a similar trap, it’s crucial to contact the relevant authorities and law enforcement for help. As the virtual world keeps advancing, so should our awareness, skepticism, and ability to bounce back. It serves as evidence of the dynamics between the virtual and the real, and a reminder that, in our digital age, it’s not just our passwords that require protection, but our understanding and suspicion as well.",
    "html_url": "https://blog.compass-security.com/2023/12/exposing-the-scammers-unmasking-the-elaborate-job-offering-scam/",
    "text": "In the era of the internet, scams vary in forms, targeting those who aren’t cautious. Lately, a fresh scam focused on Switzerland has gained attention on social media and in the news. This scam revolves around job offers from a seemingly genuine headhunting company. I chose to engage with the scammers to uncover the secrets of this scheme. Here’s what happened.\n\nHeadhunting for the Chief of Victims\n\nMy curiosity drove me to explore the deceptive realm of job scams, keen to understand their workings and motivations. I got a WhatsApp message from someone named Kristina, alleging to represent vChiefs, a genuine executive headhunting company seeking fresh talent. Yet, the reality was very different.\n\nAlthough vChiefs is a real company, focusing on recruiting top executives for C-level roles, those behind the messages were evidently not scouting for corporate leaders. Instead, they aimed to trap victims in a fraudulent scheme, luring them with payments in USDT, a cryptocurrency tied to the US dollar.\n\nAt first, I opted for a bit of amusement, adopting a playful Italian-sounding alias in our conversation. Unfortunately, the scammer doesn’t speak Italian and directed me to their HR department, promising contact from someone named Bonny.\n\nIn her HR role, Bonny conveyed that Kristina had recommended me for the job. Skepticism arose when I discovered Kristina had used the WhatsApp alias “Ava.” To address my doubts, Bonny presented a screenshot of her chat with Ava (or Kristina), leading to an unforeseen twist.\n\nThe screenshot displayed numerous Chinese characters, hinting that the scammers could be operating from an Asian country, possibly China. Despite this, I chose to continue and observe where this scam would lead.\n\nLet the Games begin\n\nShortly afterward, Bonny presented me with the so-called job, which was, in reality, the scam. She outlined a training session lasting 10 to 30 minutes, but little did I know, it would occupy my entire evening. But first, they showcased the potential earnings.\n\nYou start on a Bronze level, providing an opportunity to progress through Silver, Gold, and Platinum tiers based on earnings. The higher the tier, the more substantial the profits and responsibilities. Bonny also introduced me to MMC, the alleged company behind this opportunity, supported by an intriguing yet perplexing promotional video.\n\nWelcome to the Nonsensical\n\nIt left me puzzled, resembling a mix of arbitrary text with sporadic mentions of blockchain technology. Nevertheless, I was prepared for the actual work ahead.\n\nBonny gave me a website URL and a referral code for registration, accompanied by detailed instructions. Following the process, I sent her a screenshot as directed and already had 20 USDT in my digital wallet to kickstart my work. Once the initial steps were done, I forwarded Bonny my referral code to establish a training account in my name. She then provided the login details for our shared account.\n\nBonny always asked for screenshots and I didn’t want to look like a professional.\n\nGetting Down to Business\n\nBonny kickstarted the work by generously adding 1000 USDT to my account, elevating my status to Silver which increased earnings. She then gave instructions for a straightforward process: My main task was to activate the work wizard by choosing “Launch Evolution” and clicking “Evolve” for the listed apps.\n\n\nEach app presented its “Total” price and computed “Profits,” correlating with my Silver-level. With each “Evolve” click, my balance initially decreased by the app’s “Total” price, only to increase again by both the “Total” and the “Profits.” Essentially, each evolution I executed led to a net gain, intensifying my fascination with this scam.\n\nThe Illusion of Executive Applications\n\nEverything seemed to be going smoothly until, after around 29 successful clicks, my status suddenly changed to “Pending.” Confused, I reached out to Bonny for clarification.\n\nShe promptly responded, explaining that I had received a “random gift” of an “Executive Application.” She emphasized the rarity and benefit of this occurrence, although it left me stuck. Bonny elaborated that Executive Applications, though expensive, promised four times the usual profits. To continue, I would need to fund my account to cover the associated costs, and Bonny kindly offered to assist me with the process.\n\nFirst, I had to contact customer service via WhatsApp or Telegram, sharing the training account’s username and requesting a status check. Customer service quickly responded, instructing me to transfer several hundred dollars to a designated wallet. I relayed the information to Bonny, who executed the transaction, topping up my account and allowing me to continue.\n\nThis cycle repeated a few times as I encountered more applications. Bonny assured me of my good fortune in receiving numerous Executive Applications in a single day.\n\nMission Accomplished: Or So It Seemed\n\nWith my training completed, Bonny expressed her pride in my progress. She informed me that she would withdraw the entire balance from the training account, which she had financed. I was now set to venture into this job on my own, tasked evolving applications and accumulating profits. However, this newfound independence came with a hidden twist.\n\nSome applications carried a “Total” cost that exceeded my current balance, just like the “Executive Applications” before, causing it to dip into the negative. This is when the truth of the scam came into focus: In contrast to the guided training phase where Bonny had conveniently handled such issues, I was now compelled to tackle the situation independently.\n\nTo continue working, I had to contact customer service and provide my training account’s username. Their response was prompt and what I was expecting all along: I was told to top up the negative balance by transferring real money into their wallet. This marked a critical moment where the scammers aimed for me to take the bait, investing my own funds in hope of illusory profits.\n\nBuilding Virtual Bonds\n\n\nWhile engaging in authentic tasks, Bonny extended an invitation to join the “recreational group.” This community comprised 15-20 members. Discussions ranged from finances and work to gaming, food, and more. It was a diverse group that provided an opportunity to connect with others while earning. Bonny even disclosed her daily earnings, fostering a sense of camaraderie.\n\nDuring my engagement, Bonny took on various roles. Following my initial day of work, she playfully criticized me for sending what she deemed ‘very low-quality pictures and screenshots.’ The following morning, as part of her routine, she shared an emotional quote: ‘Good morning! What can be more blissful than waking up to God’s graces? Have a blessed day.’ These daily quotes aimed to inspire and motivate, fostering emotional connections between us and in the group.\n\nBonny persistently encouraged me to initiate my work, assuring that success was within reach. She even went to the extent of offering help in setting up a wallet to deposit my money into their system. Her dedication to keeping me engaged and involved in the scam remained steadfast.\n\nIn a notably surprising twist, Bonny took the initiative to make a phone call one day. Identifying herself as Bonny, she inquired if I had some free time for a chat. However, it became apparent that the voice on the other end lacked the authenticity of a real person. It bore a distinct robotic tone, despite its female characteristics, adding another layer of deception to the whole story.\n\nThe Deceptive Truth Revealed\n\nHowever, behind this facade of camaraderie lay a web of deception. During and after my training I continuously tracked the transactions to the designated wallet addresses, only to discover that no money had ever been transferred. In addition, I changed the withdrawal wallet address to my own before Bonny had the opportunity to empty the training account. Yet, no transactions ever happened.\n\nIn order to change the withdrawal address, I noticed that my profile had a section for editing details, including the withdrawal wallet address. Initially, it appeared that Bonny had pre-filled this and it couldn’t be changed without a security password. However, due to my security analyst background, I had already uncovered the withdrawal password at the beginning of the ordeal. This not only allowed me to modify the withdrawal address discreetly but also exposed a significant security flaw on their part. And everything Bonny had shown me was fake, with not a single dollar ever being transferred during my training.\n\nWhy It Works\n\nThe basic truth is, you can’t make money magically. The scammers make up apps with different levels of popularity and fake prices. When you think about it seriously, you can see it’s just a big lie. But, why do people still fall for it?\n\nThe crucial factor is in the training phase, where the guide convincingly shows that the system not only works but also brings in profits. Every transaction Bonny made appeared to boost my balance, creating a false sense of legitimacy. What’s interesting about this psychological manipulation is that it not only gives the illusion of making money but also triggers a surge of positive emotions. The Executive Applications, portrayed as rare, special, and symbols of good luck, are cleverly integrated into the story, fostering a sense of pride and accomplishment.\n\nIf you approach the scam with skepticism, it’s easy to lose that doubt during the training and start believing that it works. That’s exactly what the scammers want—to make you believe in the illusion of success, prompting you to deposit money into your account and unintentionally lose it.\n\nFurthermore, the group of fellow participants seems to consist of real people, creating an environment that seems genuine. However, it’s highly probable that these individuals are just as imaginary as the scam itself.\n\nKey Takeaways\n\nIn the larger picture, my dive into the heart of this tricky online scam wasn’t just a story of deceit and fascination; it was a profound lesson in digital literacy and human behavior. The experience highlighted the crucial need to be careful in our increasingly connected world.\n\nAs things calmed down and I looked at the pieces of this misleading puzzle, it was clear that the effectiveness of deception doesn’t just come from technical skill but also from taking advantage of our psychological weaknesses. The scammers targeted our natural desires for success, wealth, and belonging, crafting an environment that played into these aspirations.\n\nIf you come across such a scam, the best thing to do is report it as spam and block the sender. But for those who have fallen into this or a similar trap, it’s crucial to contact the relevant authorities and law enforcement for help. These scammers operate globally, and only through a combined effort can they be held accountable.\n\nMy exploration into the core of this online scam, though unusual, was an eye-opener—a chance to expose the workings of deception and untangle the intricate threads of human psychology. As the virtual world keeps advancing, so should our awareness, skepticism, and ability to bounce back. In a realm where illusions can pretend to be reality, we need to stay watchful, careful, and most importantly, digitally savvy.\n\nI hope you found this account both enlightening and entertaining. It serves as evidence of the dynamics between the virtual and the real, and a reminder that, in our digital age, it’s not just our passwords that require protection, but our understanding and suspicion as well. Stay vigilant, stay informed, and above all, stay safe!",
    "title": "Exposing the Scammers: Unmasking the Elaborate Job Offering Scam"
}
{
    "brief": "But in the history of competitive endeavours nobody has won by playing defence alone. We have this idea that we can wrap our users and systems in enough padding to protect them in a world where guns exist. We’ve leaned so hard into this idea that we’re on the floor and it’s time to look up.",
    "html_url": "https://sensepost.com/blog/2023/why-defend-harder-wont-work-in-the-long-run-and-what-to-do-instead-arrest-criminals/",
    "text": "The whole of information/cyber security is founded on the idea that we can defend ourselves into security. But in the history of competitive endeavours nobody has won by playing defence alone. We have this idea that we can wrap our users and systems in enough padding to protect them in a world where guns exist. We’ve leaned so hard into this idea that we’re on the floor and it’s time to look up. \n\nIn a recent keynote at BSides Cape Town I explored this idea and tried to convince people both that defending harder is an idea with a diminishing ROI, and that we instead need to use law enforcement to impact the problem at its root cause – the criminals. Most in infosec believe and operate as if this is neither their job nor a worthwhile pursuit. I want to change that. First by convincing you that it’s worthwhile, then by helping us understand how we can orient our activities to better invoke law enforcement. \n\nI’d love you to watch the talk and let me know what you think. Because it’s an idea that needs experimentation and practise. Can you include some of this in your strategy for next year?\n\nWatch on YouTube",
    "title": "Why defend harder won’t work in the long run and what to do instead – arrest criminals"
}
{
    "brief": "That is, giving back more than you take. And by giving back I don’t mean *just* doing research or writing tools. In my talk, “your contributions, today” I reflected on a current view of practical security research and contributions in a time of ever-increasing systems complexity, abstractions and Instagram reels.",
    "html_url": "https://sensepost.com/blog/2023/your-contributions-today/",
    "text": "Keynoting 0xcon in Johannesburg this year, I had the immense privilege of talking and sharing ideas about something that is dear to my heart. That is, giving back more than you take. And by giving back I don’t mean *just* doing research or writing tools. Instead, giving back includes things like writing documentation or even just teaching someone else!\n\nIn my talk, “your contributions, today” I reflected on a current view of practical security research and contributions in a time of ever-increasing systems complexity, abstractions and Instagram reels. By drawing parallels to the “Free-rider Problem” as described in an economics context, I argued that as an industry we need to caution against this phenomenon manifesting by actively making contributions.\n\nThe talk is available to view on YouTube now, and you can get the slides from my GitHub repository. What are you going to contribute today?",
    "title": "your contributions, today"
}
