{
    "brief": "Arguably one of the largest hacking conferences in South Africa, BSides Cape Town 2023 is around the corner and the SensePost Team is there with a jam packed agenda demonstrating our latest research (with five talks), challenges and more! Opening BSides Cape Town 2023 is @singe with a Keynote “Impose Cost: Our defences eventually fail and we need to take the fight to the criminals” where he will argue that the only way to effectively and realistically succeed in defending our networks is to take the challenge to the real criminals and not just wait for them to come. Be sure to come and visit the machine to learn how to hack it to win some prizes!",
    "html_url": "https://sensepost.com/blog/2023/were-going-to-bsides-cape-town-2023/",
    "text": "Arguably one of the largest hacking conferences in South Africa, BSides Cape Town 2023 is around the corner and the SensePost Team is there with a jam packed agenda demonstrating our latest research (with five talks), challenges and more! In this post, I’ll summarise what you can expect. For timing related information, check out the schedule here. Be sure to come and say hi at our stand in the chill area too.\n\ntalks\n\nOpening BSides Cape Town 2023 is @singe with a Keynote “Impose Cost: Our defences eventually fail and we need to take the fight to the criminals” where he will argue that the only way to effectively and realistically succeed in defending our networks is to take the challenge to the real criminals and not just wait for them to come.\n\nNext we have Reino Mostert in a talk “LPE in enterprise software” demonstrating a Local Privilege Escalation vulnerability he found which was made possible by extending James Forshaw‘s directory junction work, but chaining them to effectively bypass a mitigation the vendor implemented.\n\nFollowing that, @leonjza will present a talk titled “Attacking Microsoft Exchange: Fusing LightNeuron with Cobalt Strike” where he will reflect on a Russian threat actor known as Turla. Leon will dive into the details and a reimagination of an Exchange backdoor that Turla used, called LightNeuron while fusing it with Cobalt Strike to interact with a beacon over email.\n\nNext, @shifttymike will present “Noooooooooo touch!” where he will walk through the journey of researching “no touch” sensors commonly used to allow people to exit buildings by opening doors after moving your hand past one of these sensors. Michael will demonstrate how he bypassed these sensors allowing him to open doors (for example) from the wrong side of a door, and at a significantly larger distance. He may even have a nifty little portable version of the gear required for this…\n\nFinally, @singe will deliver a talk titled “Performance Hacking – how to hack your tools to go faster” where he will dive into performance details of building an efficient password cracking tool, how to perform performance analysis and more, to ultimately get a tool that works faster using computer science and not just more hardware.\n\nchallenge – vending machine\n\nLast year, together with @elasticninja we tried to have a vending machine challenge up and running for conference participants to hack at with a bunch of prizes up for grabs. It was a lot of fun (even though a lot of stuff went wrong), and learning from those lessons, we’re back with the vending machine this year, with new and improved hardware, challenges and more. Be sure to come and visit the machine to learn how to hack it to win some prizes!\n\nvolunteers\n\nNot everything is obviously visible like talks and challenges. In fact, some of the hardest work goes into organising the event. We’re proud to have Isak, Geoffrey and Roberto from the SensePost team form part of the organising team helping make BSides Cape Town what it is!",
    "title": "we’re going to bsides cape town 2023"
}
{
    "brief": "In this quick-post, we’ll explore how to convert Windows type libraries (TLB) into IDA type information libraries (TIL). Once the C++ header files generated, IDAClang can be used to convert these into TILs. Given both MSVC and IDAClang rely on a properly configured developer environment (e.g., a configured INCLUDE environment variable), this article assumes all commands are issued within a Visual Studio Developer Command Prompt such as the “x64 Native Tools Command Prompt”. As such, creating a C++ file to import a type library will generate its C++ header. Once the C++ file has been created, we can rely on the MSVC compiler to generate the necessary headers. With the C++ headers generated, we can now proceed to create the IDA type information library. To do so, we can create a new C++ header file that will reference any standard headers (e.g., those from the .NET Framework Developer Pack) and generated headers (i.e., the previously generated mscorlib.tlh) we wish to use in IDA. The following is our example til.h. Once the C++ header file created, we can rely on IDAClang to generate the TIL. As an example, we published our .NET type information library mscoru.til. Figure 3: A capture of IDA’s Available Type Libraries.",
    "html_url": "https://blog.nviso.eu/2023/11/07/generating-ida-type-information-libraries-from-windows-type-libraries/",
    "text": "When working with IDA, a commonly leveraged feature are type information libraries (TIL). These libraries contain high-level type information such as function prototypes, type definitions, standard structures or enums; enabling IDA to convert statements such as movsxd rbx, dword ptr [r12+3Ch] into, for example, the more human-readable counterpart movsxd rbx, [r12+IMAGE_DOS_HEADER.e_lfanew].\n\nOn Windows, a similar concept called type libraries (TLB) exists to describe COM (Component Object Model) objects. In a nutshell, COM provides a language-independent interface to objects, abstracting how they have been implemented themselves.\n\nIn this quick-post, we’ll explore how to convert Windows type libraries (TLB) into IDA type information libraries (TIL). In particular, we’ll generate the necessary type information library to analyze .NET injection into unmanaged processes using mscoree.dll and mscorlib.dll (e.g., through _AppDomain). In a hurry? Grab the .NET type information library directly!\n\nAbstract\n\nAchieving TLB-to-TIL conversion can be done through an intermediary C++ conversion:\n\nFirst, the MSVC (Microsoft Visual C++) compiler can be leveraged to convert TLBs into their respective C++ header files.\nOnce the C++ header files generated, IDAClang can be used to convert these into TILs.\nFigure 1: A schema of MSVC converting TLBs into C++ as well as IDAClang converting C++ into TILs.\nRequirements\n\nTo achieve TLB-to-TIL conversion, this article requires the following tools:\n\nThe MSVC (Microsoft Visual C++) compiler installed through Visual Studio*.\nThe IDAClang command-line utility.\n\n* For our example, we’ll be generating a type information library targeting the .NET Framework, hence also requiring header files part of the .NET Framework Developer Pack (a.k.a. SDK). The .NET Framework Developer Pack can be installed through Visual Studio.\n\nGiven both MSVC and IDAClang rely on a properly configured developer environment (e.g., a configured INCLUDE environment variable), this article assumes all commands are issued within a Visual Studio Developer Command Prompt such as the “x64 Native Tools Command Prompt”.\n\nFigure 2: A capture of the “x64 Native Tools Command Prompt” within the Windows Start menu.\nConverting Microsoft Type Libraries to C++ Headers\n\nWindows type libraries are a Windows-specific feature which integrates seamlessly with the MSVC compiler through the #import statement.\n\n#import creates two header files that reconstruct the type library contents in C++ source code. The primary header file is similar to the one produced by the Microsoft Interface Definition Language (MIDL) compiler, but with additional compiler-generated code and data. The primary header file has the same base name as the type library, plus a .TLH extension.\n\nSource: learn.microsoft.com\n\nAs such, creating a C++ file to import a type library will generate its C++ header. Given we wish to convert mscorlib.tlb into C++ headers, we can create the following C++ file named, for example, til.cpp.\n\n1\n\t\n#import \"mscorlib.tlb\" raw_interfaces_only auto_rename\n\nOnce the C++ file has been created, we can rely on the MSVC compiler to generate the necessary headers. The beneath command will generate the mscorlib.tlh file.\n\n1\n\t\nCL.exe /c /D NDEBUG /D _CONSOLE /D _UNICODE /D UNICODE /permissive- /TP til.cpp\nConverting C++ Headers to IDA Type Information Libraries\n\nWith the C++ headers generated, we can now proceed to create the IDA type information library. To do so, we can create a new C++ header file that will reference any standard headers (e.g., those from the .NET Framework Developer Pack) and generated headers (i.e., the previously generated mscorlib.tlh) we wish to use in IDA. The following is our example til.h.\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n\t\n// Include standard headers\n// Example: Microsoft .NET Framework Developer Pack\n#include <alink.h>\n#include <clrdata.h>\n#include <cordebug.h>\n#include <corhlpr.h>\n#include <corprof.h>\n#include <corpub.h>\n#include <corsym.h>\n#include <fusion.h>\n#include <gchost.h>\n#include <ICeeFileGen.h>\n#include <isolation.h>\n#include <ivalidator.h>\n#include <ivehandler.h>\n#include <metahost.h>\n#include <mscoree.h>\n#include <openum.h>\n#include <StrongName.h>\n#include <tlbref.h>\n#include <VerError.h>\n \n// Include generated headers\n// Example: Microsoft Common Language Runtime Class Library\n//          The mscorlib.h generated from mscorlib.tlb\n#include \"mscorlib.tlh\"\n\nOnce the C++ header file created, we can rely on IDAClang to generate the TIL.\n\n1\n\t\nidaclang.exe -x c++ -target x86_64-pc-windows -ferror-limit=0 --idaclang-tildesc \"Example\" --idaclang-tilname \"example.til\" til.h\n\nMSVC and Clang (used in IDAClang) are two different C++ compilers. While they can mostly agree, compiling MSVC-generated C++ code using Clang is bound to generate non-fatal errors. While IDAClang may generate quite some errors as shown below, the TIL conversion should succeed after a moment.\n\n1\n2\n3\n4\n\t\nIDACLANG: nonfatal: ./mscorlib.tlh:10774:1: error: enumeration previously declared with fixed underlying type\nIDACLANG: nonfatal: ./mscorlib.tlh:11509:64: error: expected ';' after struct\nIDACLANG: nonfatal: ./mscorlib.tlh:11509:1: error: declaration of anonymous struct must be a definition\nIDACLANG: nonfatal: ./mscorlib.tlh:11510:11: error: expected unqualified-id\n\nAs an example, we published our .NET type information library mscoru.til.\n\nUsing the IDA Type Information Library\n\nOnce the TIL generated, we can proceed to make it available to IDA. To do so, copy the TIL to the appropriate folder which, in our example, could be the C:\\Program Files\\IDA Pro 8.3\\til\\pc directory. Once the TIL staged, IDA should display the new type information library and allow it to be loaded.\n\nFigure 3: A capture of IDA’s Available Type Libraries.\n\nWith the TIL loaded, we can now instruct IDA to import the new structures such as ICLRMetaHost and its ICLRMetaHost_vtbl virtual function table.\n\nFigure 4: A capture of IDA’s ICLRMetaHost structure.\nFigure 5: A capture of IDA’s ICLRMetaHost_vtbl structure.\n\nOnce our structures imported, we can leverage IDA’s structure offsets to make raw offsets human-readable as observed in the following slider (left before, right after).\n\nFigure 6: A capture of IDA’s ICLRMetaHost.GetRuntime call.\n\nIn our .NET injection analysis, this enables us to identify where the raw .NET assembly is loaded as observed in the beneath slider (left before, right after). Such information in turn allows us to identify from where it originates and where we could best intercept it for further analysis.\n\nFigure 7: A capture of IDA’s _AppDomain.Load_3 call.\nConclusions & Lessons Learned\n\nWhile tools such as OLEViewer alongside MIDL could in theory generate C++ code as well, we found these to be unreliable. Instead, working with MSVC and IDAClang provides a quick (and clean) approach to convert TLBs into TILs.\n\nThe above described process can be extended to other abused COM objects such as the Windows Script Host Object Model (with TLB %SystemRoot%\\System32\\wshom.ocx) or the Microsoft Management Console (with TLB %SystemRoot%\\System32\\mmc.exe).\n\nBy creating IDA type information libraries matching libraries used by adversaries we gain the capability to properly understand their tooling, how to analyze further stages and how to best defend against them.\n\nReferences\nhttps://learn.microsoft.com/en-us/cpp/preprocessor/hash-import-directive-cpp\nhttps://hex-rays.com/tutorials/idaclang/\nhttps://thewover.github.io/Introducing-Donut/#disposable-appdomains\n\nMaxime Thiebaut\n\nMaxime Thiebaut is a GCFA-certified Incident Response & Digital Forensics Analyst within NVISO CSIRT. He spends most of his time performing defensive research and responding to incidents. Previously, Maxime worked on the SANS SEC699 course. Besides his coding capabilities, Maxime enjoys reverse engineering samples observed in the wild.\n\n\nMastodon\nShare this:\nTwitterRedditWhatsAppEmail\nLike this:\nLoading...",
    "title": "Generating IDA Type Information Libraries from Windows Type Libraries"
}
{
    "brief": "Within this broader term are technologies like machine learning, neural networks, and deep learning, each having its significance in cybersecurity. These areas span from ‘Automated Security Control Validation’ to ‘Decision Support for Risk Planning’, showcasing the various types of technology that can be categorized under each domain. Platforms like an Information Sharing Property Platform could be essential, promoting a collective approach to cybersecurity, letting businesses share insights and strengthen overall security. To sum up, in today’s digital world, for businesses to succeed, it’s imperative to embrace and stay updated with advanced security practices. Below, we will examine each domain in detail, aiming to identify the pros and cons of employing AI and machine learning techniques, as derived from our analysis of the meta-study within the cybersecurity context. Overview of advantages and disadvantages of the integration of AI in Automated Security Control Validation Overview of advantages and disadvantages of the integration of AI in Automated Risk Analysis and Impact Assessment Advantages\tDisadvantages Simulation of various risk scenarios, aiding in decision-making. Overview of advantages and disadvantages of the integration of AI in Decision Support for Risk Planning Advantages\tDisadvantages Immediate allocation of responsibilities during incidents. Overview of advantages and disadvantages of the integration of AI in Automated Responsibility Allocation AI processing shared information might raise privacy issues. Spot emerging threats or vulnerabilities from shared data. Overview of advantages and disadvantages of the integration of AI in Information Sharing Property Platform Speed and Data Understanding and Decision Making Adaptability and Complexity Security and Information In the context of AI and machine learning within cybersecurity, several themes are evident: However, it’s important to note that the quality of outcomes is contingent on the integrity of the data input, and there exists a risk of over-reliance on this speed. Yet, AI systems might not always replicate the nuanced understanding characteristic of human cognition.",
    "html_url": "https://blog.nviso.eu/2023/11/08/ai-in-cybersecurity-bridging-the-gap-between-imagination-and-reality/",
    "text": "Introduction\n\nIn today’s digital environment, we encounter a mix of evolving cyber systems and the complexities they introduce. One notable influence in this space is artificial intelligence (AI), alongside associated technologies such as machine learning, which offer promising avenues for reshaping cyber strategies.\n\nTraditionally, cybersecurity has operated with definitive parameters, set boundaries, and post-event counteractions. Yet, given the growth in digital data and the evolving nature of threats, there’s a clear shift towards strategies that are not only responsive but also proactive. AI and machine learning serve this purpose, providing defenses that are not only immediate but also predictive.\n\nIt’s important to clarify that the discussion isn’t solely about AI as a standalone term. Within this broader term are technologies like machine learning, neural networks, and deep learning, each having its significance in cybersecurity. However, given the extensive scope, our focus will be on select areas, shedding light on how these technologies function and their practical implications in cybersecurity.\n\nThe goal here is to explore the roles of AI and machine learning without presenting them as the singular answer but rather to understand their potential and limitations within cybersecurity.\n\nFor this purpose, a well-known cybersecurity framework proposed by NIST was used to understand the solution categories needed to protect, detect, react and defend against cyberattacks\n\nR. Kaur et al., Information Fusion 97 (2023) 101804\nThe pillars of the NIST framework\n\nThe subsequent section provides a graphical representation that outlines specific areas in which AI and machine learning are applied in cybersecurity. These areas span from ‘Automated Security Control Validation’ to ‘Decision Support for Risk Planning’, showcasing the various types of technology that can be categorized under each domain. This visualization serves as a reference to understand the scope and classification of technologies discussed in the article.\n\nCreated after:\nRamanpreet Kaur, Dušan Gabrijelčič, Tomaž Klobučar,\nArtificial intelligence for cybersecurity: Literature review and future research directions, Information Fusion, Volume 97, 2023\nhttps://doi.org/10.1016/j.inffus.2023.101804.\n\nIn the domain of cybersecurity, while much attention has been given to Protection and Detection, there are other areas that demand attention and hold significant promise (in our case that would be Identify, Respond, Recover), especially with the advent of AI technologies. Many of these areas have been sidelined in popular discussions but are now emerging as pivotal components in the evolving cybersecurity landscape. Among these areas, we have identified several noteworthy topics:\n\nAutomated Security Control Validation: This refers to the automated processes used to confirm that security measures are operating correctly within a given system.\nAutomated Risk Analysis and Impact Assessment: A process that uses automation to evaluate potential threats and the possible consequences they could have on an organization.\nDecision Support for Risk Planning: Using technology to aid decision-makers in strategizing and planning for potential risks.\nAutomated Responsibility Allocation: A method that uses automation to assign roles and responsibilities within a system, ensuring that tasks are designated to the right entity or personnel.\nInformation Sharing Property Platform: A platform designed to facilitate the sharing of information across different entities in a secure manner.\n\nThe foundation of this stems from the previously cited publication, a meta study\n\nresulted in 2395 studies, of which 236 were identified as primary. This article classifies the identified AI use cases based on a NIST cybersecurity framework using a thematic analysis approach.\n\nhttps://doi.org/10.1016/j.inffus.2023.101804.\nWhy these topics?\n\nIn the current digital environment, businesses are required to anticipate and mitigate threats and vulnerabilities. The cyber landscape is continually changing. What was once considered secure can now be a weak point, underscoring the relevance of tools like Automated Security Control Validation and Risk Analysis. These tools enable companies to promptly detect and rectify vulnerabilities, staying abreast of the sophisticated techniques used by adversaries.\n\nBusiness continuity is also crucial. Unresolved security issues can disrupt operations, affecting revenue and brand perception. Decision Support for Risk Planning offers a systematic approach for risk assessment and management, ensuring smooth operations amidst emerging threats.\n\nRegulatory compliance adds another layer of complexity in many industries. Meeting these regulations often means implementing stringent security protocols. With updated practices such as automated responsibility allocation, companies can ensure adherence to legal requirements, minimizing legal repercussions.\n\nAs organizations grow, managing security across expansive infrastructures manually becomes complex. Automated solutions offer scalability in security, allowing businesses to expand without a corresponding rise in resources.\n\nInformation today represents a strategic asset. Platforms like an Information Sharing Property Platform could be essential, promoting a collective approach to cybersecurity, letting businesses share insights and strengthen overall security.\n\nBuilding trust with customers, partners, and stakeholders is fundamental. Ensuring data security and safe interactions enhances this trust, providing a competitive advantage.\n\nTo sum up, in today’s digital world, for businesses to succeed, it’s imperative to embrace and stay updated with advanced security practices.\n\nEvaluation of the studies under consideration\n\nBelow, we will examine each domain in detail, aiming to identify the pros and cons of employing AI and machine learning techniques, as derived from our analysis of the meta-study within the cybersecurity context.\n\nAutomated Security Control Validation\n\nAdvantages\tDisadvantages\nAutomated checks can be performed much faster than manual validations.\tMight occasionally flag legitimate configurations as violations.\nPerform checks uniformly without human error.\tMight not always adapt swiftly to rapidly evolving threat landscapes or new security protocols.\nHandle large infrastructures without additional resources.\tOver-dependence on AI might lead to negligence in manual checks.\nReal-time validation, ensuring immediate detection of security misconfigurations.\tMay not capture subtle nuances or instinctual insights that experienced human professionals might recognize in complex security scenarios.\nOverview of advantages and disadvantages of the integration of AI in Automated Security Control Validation\n\nAutomated Risk Analysis and Impact Assessment\n\nAdvantages\tDisadvantages\nProcess vast amounts of data rapidly, providing insights quicker.\tEffective AI integration requires understanding and tuning of the models.\nPredict potential future threats based on patterns.\tExcessive trust in AI’s recommendations might overshadow human judgment.\nAlgorithms can correlate data from various sources for a more comprehensive risk profile.\tEffectiveness is dependent on the quality of the data fed to it.\nOverview of advantages and disadvantages of the integration of AI in Automated Risk Analysis and Impact Assessment\n\nDecision Support for Risk Planning\n\nAdvantages\tDisadvantages\nSimulation of various risk scenarios, aiding in decision-making.\tIf historical data has biases, AI recommendations might inherit them.\nProvide real-time updates based on changing data.\tIt might be challenging to effectively implement AI in decision-making processes.\nOverview of advantages and disadvantages of the integration of AI in Decision Support for Risk Planning\n\nAutomated Responsibility Allocation\n\nAdvantages\tDisadvantages\nImmediate allocation of responsibilities during incidents.\tAI might not understand the nuances of every situation.\nReduce decision-making time during crises.\tRequires continuous updates to responsibility matrices and rules.\nDecisions are based on data, not emotions or internal politics.\tSole reliance on AI might lead to issues if the system fails during a critical incident.\nOverview of advantages and disadvantages of the integration of AI in Automated Responsibility Allocation\n\nInformation Sharing Property Platform\n\nAdvantages\tDisadvantages\nShift through vast amounts of shared information to find relevant insights.\tAI processing shared information might raise privacy issues.\nSpot emerging threats or vulnerabilities from shared data.\tMight misinterpret or take out of context certain shared information.\nGenerate summaries or insights from the shared information.\tIf not properly secured, AI systems could be a target for malicious actors trying to manipulate shared data.\nOverview of advantages and disadvantages of the integration of AI in Information Sharing Property Platform\n\nWhen examining the pros and cons presented, are there recurring themes that allow us to draw overarching conclusions? INDEED, there are!\n\nWe can identify four distinct categories:\n\nSpeed and Data\nUnderstanding and Decision Making\nAdaptability and Complexity\nSecurity and Information\n\nBut what does each category signify, and how do they influence the broader scope of AI and machine learning in cybersecurity?\n\nConclusion\n\nIn the context of AI and machine learning within cybersecurity, several themes are evident:\n\nRegarding Speed and Data, AI facilitates rapid and uniform data processing. However, it’s important to note that the quality of outcomes is contingent on the integrity of the data input, and there exists a risk of over-reliance on this speed.\n\nIn the area of Understanding and Decision Making, AI offers expansive views, promoting more objective decision-making processes. Yet, AI systems might not always replicate the nuanced understanding characteristic of human cognition.\n\nWithin Adaptability and Complexity, AI’s strength lies in its scalability and its ability to model diverse scenarios. Nevertheless, these systems can face challenges adapting to rapid technological changes, and their deployment can be intricate.\n\nFor Security and Information, AI’s capability for real-time monitoring allows for immediate threat detection. However, the speed of processing might increase the probability of misinterpretations, potentially introducing security vulnerabilities.\n\nIn addition to these themes, the Human Factor remains pivotal. AI systems, despite their sophistication, cannot replace human judgment, especially in ambiguous situations that require intuitive reasoning. The human element brings a unique combination of experience, intuition, and ethical consideration, aspects that AI currently cannot replicate fully. Hence, while automating processes can enhance efficiency, the human oversight ensures that decisions align with organizational values and the broader context. Balancing the capabilities of AI with human expertise optimizes the cybersecurity framework, ensuring robustness and adaptability.\n\nOverall, while AI and machine learning bring substantial advantages to cybersecurity, it’s crucial to consider their inherent limitations and dependencies.\n\nMaurice Striek\n\nMaurice Striek is a Consultant in the Cyber Security & Architecture Team (CSA) at NVISO. His expertise lies in risk analysis based on IT-Grundschutz and ISO 27001/2 standards, as well as data analysis and data management.\n\nLinkedIn\nShare this:\nTwitterRedditWhatsAppEmail\nLike this:\nLoading...",
    "title": "AI in Cybersecurity: Bridging the Gap Between Imagination and Reality"
}
