{
    "brief": [
        "If a laptop is lost or stolen, an attacker who gains physical possession of the machine cannot access the data or tamper with the system, even when removing the disk and accessing it from another system.   ...    BitLocker Configuration   ...    In the TPM-only mode, the Volume Master Key (VMK) is released during boot and sent to the CPU.   ...    This gives an attacker the opportunity to sniff the data channel and intercept the VMK.   ...    TPM: In the TPM-only mode, the user is not required to provide a protector to unlock the TPM.   ...    During boot, the boot environment is measured, meaning that the firmware and software that is loaded is tracked and the measurement values are stored in the Platform Configuration Registers (PCR).   ...    TPM and PIN: The VMK is only released to the CPU after the user has provided the correct PIN.   ...    TPM and Startup Key: The VMK is only released to the CPU after the user has provided the correct startup key.   ...    Attack   ...    The goal of the attack is to sniff the communication between the TPM chip and the CPU.   ...    Afterwards, the BitLocker recovery key can be obtained with the Sigrok BitLocker Key Extractor tool:   ...    This section discusses various mitigation strategies as well as operational considerations that require attention in practice.   ...    Recall from a previous section that the attack exploits the fact that in TPM-only mode the VMK is automatically released and sent to the CPU during boot, allowing the attacker to recover it by sniffing the bus communication.   ...    If tamper protection is detected, the system will either prompt the user for the BIOS password or the BitLocker recovery key during the next boot cycle.   ...    Naturally, it cannot be guaranteed that the PIN can be kept secret, and a motivated attacker might very well be able to learn it through several means.   ...    An attacker in possession of the PIN can carry out the same attack as described in the previous section, with the only exception that they have to enter the PIN during boot to release the VMK.   ...    Depending on the environment or the type of adversary, the most secure BitLocker configuration might not offer adequate protection.   ...   ",
        "I\nf\n \na\n \nl\na\np\nt\no\np\n \ni\ns\n \nl\no\ns\nt\n \no\nr\n \ns\nt\no\nl\ne\nn\n,\n \na\nn\n \na\nt\nt\na\nc\nk\ne\nr\n \nw\nh\no\n \ng\na\ni\nn\ns\n \np\nh\ny\ns\ni\nc\na\nl\n \np\no\ns\ns\ne\ns\ns\ni\no\nn\n \no\nf\n \nt\nh\ne\n \nm\na\nc\nh\ni\nn\ne\n \nc\na\nn\nn\no\nt\n \na\nc\nc\ne\ns\ns\n \nt\nh\ne\n \nd\na\nt\na\n \no\nr\n \nt\na\nm\np\ne\nr\n \nw\ni\nt\nh\n \nt\nh\ne\n \ns\ny\ns\nt\ne\nm\n,\n \ne\nv\ne\nn\n \nw\nh\ne\nn\n \nr\ne\nm\no\nv\ni\nn\ng\n \nt\nh\ne\n \nd\ni\ns\nk\n \na\nn\nd\n \na\nc\nc\ne\ns\ns\ni\nn\ng\n \ni\nt\n \nf\nr\no\nm\n \na\nn\no\nt\nh\ne\nr\n \ns\ny\ns\nt\ne\nm\n.\n \n \n \n.\n.\n.\n \n \n \n \nB\ni\nt\nL\no\nc\nk\ne\nr\n \nC\no\nn\nf\ni\ng\nu\nr\na\nt\ni\no\nn\n \n \n \n.\n.\n.\n \n \n \n \nI\nn\n \nt\nh\ne\n \nT\nP\nM\n-\no\nn\nl\ny\n \nm\no\nd\ne\n,\n \nt\nh\ne\n \nV\no\nl\nu\nm\ne\n \nM\na\ns\nt\ne\nr\n \nK\ne\ny\n \n(\nV\nM\nK\n)\n \ni\ns\n \nr\ne\nl\ne\na\ns\ne\nd\n \nd\nu\nr\ni\nn\ng\n \nb\no\no\nt\n \na\nn\nd\n \ns\ne\nn\nt\n \nt\no\n \nt\nh\ne\n \nC\nP\nU\n.\n \n \n \n.\n.\n.\n \n \n \n \nT\nh\ni\ns\n \ng\ni\nv\ne\ns\n \na\nn\n \na\nt\nt\na\nc\nk\ne\nr\n \nt\nh\ne\n \no\np\np\no\nr\nt\nu\nn\ni\nt\ny\n \nt\no\n \ns\nn\ni\nf\nf\n \nt\nh\ne\n \nd\na\nt\na\n \nc\nh\na\nn\nn\ne\nl\n \na\nn\nd\n \ni\nn\nt\ne\nr\nc\ne\np\nt\n \nt\nh\ne\n \nV\nM\nK\n.\n \n \n \n.\n.\n.\n \n \n \n \nT\nP\nM\n:\n \nI\nn\n \nt\nh\ne\n \nT\nP\nM\n-\no\nn\nl\ny\n \nm\no\nd\ne\n,\n \nt\nh\ne\n \nu\ns\ne\nr\n \ni\ns\n \nn\no\nt\n \nr\ne\nq\nu\ni\nr\ne\nd\n \nt\no\n \np\nr\no\nv\ni\nd\ne\n \na\n \np\nr\no\nt\ne\nc\nt\no\nr\n \nt\no\n \nu\nn\nl\no\nc\nk\n \nt\nh\ne\n \nT\nP\nM\n.\n \n \n \n.\n.\n.\n \n \n \n \nD\nu\nr\ni\nn\ng\n \nb\no\no\nt\n,\n \nt\nh\ne\n \nb\no\no\nt\n \ne\nn\nv\ni\nr\no\nn\nm\ne\nn\nt\n \ni\ns\n \nm\ne\na\ns\nu\nr\ne\nd\n,\n \nm\ne\na\nn\ni\nn\ng\n \nt\nh\na\nt\n \nt\nh\ne\n \nf\ni\nr\nm\nw\na\nr\ne\n \na\nn\nd\n \ns\no\nf\nt\nw\na\nr\ne\n \nt\nh\na\nt\n \ni\ns\n \nl\no\na\nd\ne\nd\n \ni\ns\n \nt\nr\na\nc\nk\ne\nd\n \na\nn\nd\n \nt\nh\ne\n \nm\ne\na\ns\nu\nr\ne\nm\ne\nn\nt\n \nv\na\nl\nu\ne\ns\n \na\nr\ne\n \ns\nt\no\nr\ne\nd\n \ni\nn\n \nt\nh\ne\n \nP\nl\na\nt\nf\no\nr\nm\n \nC\no\nn\nf\ni\ng\nu\nr\na\nt\ni\no\nn\n \nR\ne\ng\ni\ns\nt\ne\nr\ns\n \n(\nP\nC\nR\n)\n.\n \n \n \n.\n.\n.\n \n \n \n \nT\nP\nM\n \na\nn\nd\n \nP\nI\nN\n:\n \nT\nh\ne\n \nV\nM\nK\n \ni\ns\n \no\nn\nl\ny\n \nr\ne\nl\ne\na\ns\ne\nd\n \nt\no\n \nt\nh\ne\n \nC\nP\nU\n \na\nf\nt\ne\nr\n \nt\nh\ne\n \nu\ns\ne\nr\n \nh\na\ns\n \np\nr\no\nv\ni\nd\ne\nd\n \nt\nh\ne\n \nc\no\nr\nr\ne\nc\nt\n \nP\nI\nN\n.\n \n \n \n.\n.\n.\n \n \n \n \nT\nP\nM\n \na\nn\nd\n \nS\nt\na\nr\nt\nu\np\n \nK\ne\ny\n:\n \nT\nh\ne\n \nV\nM\nK\n \ni\ns\n \no\nn\nl\ny\n \nr\ne\nl\ne\na\ns\ne\nd\n \nt\no\n \nt\nh\ne\n \nC\nP\nU\n \na\nf\nt\ne\nr\n \nt\nh\ne\n \nu\ns\ne\nr\n \nh\na\ns\n \np\nr\no\nv\ni\nd\ne\nd\n \nt\nh\ne\n \nc\no\nr\nr\ne\nc\nt\n \ns\nt\na\nr\nt\nu\np\n \nk\ne\ny\n.\n \n \n \n.\n.\n.\n \n \n \n \nA\nt\nt\na\nc\nk\n \n \n \n.\n.\n.\n \n \n \n \nT\nh\ne\n \ng\no\na\nl\n \no\nf\n \nt\nh\ne\n \na\nt\nt\na\nc\nk\n \ni\ns\n \nt\no\n \ns\nn\ni\nf\nf\n \nt\nh\ne\n \nc\no\nm\nm\nu\nn\ni\nc\na\nt\ni\no\nn\n \nb\ne\nt\nw\ne\ne\nn\n \nt\nh\ne\n \nT\nP\nM\n \nc\nh\ni\np\n \na\nn\nd\n \nt\nh\ne\n \nC\nP\nU\n.\n \n \n \n.\n.\n.\n \n \n \n \nA\nf\nt\ne\nr\nw\na\nr\nd\ns\n,\n \nt\nh\ne\n \nB\ni\nt\nL\no\nc\nk\ne\nr\n \nr\ne\nc\no\nv\ne\nr\ny\n \nk\ne\ny\n \nc\na\nn\n \nb\ne\n \no\nb\nt\na\ni\nn\ne\nd\n \nw\ni\nt\nh\n \nt\nh\ne\n \nS\ni\ng\nr\no\nk\n \nB\ni\nt\nL\no\nc\nk\ne\nr\n \nK\ne\ny\n \nE\nx\nt\nr\na\nc\nt\no\nr\n \nt\no\no\nl\n:\n \n \n \n.\n.\n.\n \n \n \n \nT\nh\ni\ns\n \ns\ne\nc\nt\ni\no\nn\n \nd\ni\ns\nc\nu\ns\ns\ne\ns\n \nv\na\nr\ni\no\nu\ns\n \nm\ni\nt\ni\ng\na\nt\ni\no\nn\n \ns\nt\nr\na\nt\ne\ng\ni\ne\ns\n \na\ns\n \nw\ne\nl\nl\n \na\ns\n \no\np\ne\nr\na\nt\ni\no\nn\na\nl\n \nc\no\nn\ns\ni\nd\ne\nr\na\nt\ni\no\nn\ns\n \nt\nh\na\nt\n \nr\ne\nq\nu\ni\nr\ne\n \na\nt\nt\ne\nn\nt\ni\no\nn\n \ni\nn\n \np\nr\na\nc\nt\ni\nc\ne\n.\n \n \n \n.\n.\n.\n \n \n \n \nR\ne\nc\na\nl\nl\n \nf\nr\no\nm\n \na\n \np\nr\ne\nv\ni\no\nu\ns\n \ns\ne\nc\nt\ni\no\nn\n \nt\nh\na\nt\n \nt\nh\ne\n \na\nt\nt\na\nc\nk\n \ne\nx\np\nl\no\ni\nt\ns\n \nt\nh\ne\n \nf\na\nc\nt\n \nt\nh\na\nt\n \ni\nn\n \nT\nP\nM\n-\no\nn\nl\ny\n \nm\no\nd\ne\n \nt\nh\ne\n \nV\nM\nK\n \ni\ns\n \na\nu\nt\no\nm\na\nt\ni\nc\na\nl\nl\ny\n \nr\ne\nl\ne\na\ns\ne\nd\n \na\nn\nd\n \ns\ne\nn\nt\n \nt\no\n \nt\nh\ne\n \nC\nP\nU\n \nd\nu\nr\ni\nn\ng\n \nb\no\no\nt\n,\n \na\nl\nl\no\nw\ni\nn\ng\n \nt\nh\ne\n \na\nt\nt\na\nc\nk\ne\nr\n \nt\no\n \nr\ne\nc\no\nv\ne\nr\n \ni\nt\n \nb\ny\n \ns\nn\ni\nf\nf\ni\nn\ng\n \nt\nh\ne\n \nb\nu\ns\n \nc\no\nm\nm\nu\nn\ni\nc\na\nt\ni\no\nn\n.\n \n \n \n.\n.\n.\n \n \n \n \nI\nf\n \nt\na\nm\np\ne\nr\n \np\nr\no\nt\ne\nc\nt\ni\no\nn\n \ni\ns\n \nd\ne\nt\ne\nc\nt\ne\nd\n,\n \nt\nh\ne\n \ns\ny\ns\nt\ne\nm\n \nw\ni\nl\nl\n \ne\ni\nt\nh\ne\nr\n \np\nr\no\nm\np\nt\n \nt\nh\ne\n \nu\ns\ne\nr\n \nf\no\nr\n \nt\nh\ne\n \nB\nI\nO\nS\n \np\na\ns\ns\nw\no\nr\nd\n \no\nr\n \nt\nh\ne\n \nB\ni\nt\nL\no\nc\nk\ne\nr\n \nr\ne\nc\no\nv\ne\nr\ny\n \nk\ne\ny\n \nd\nu\nr\ni\nn\ng\n \nt\nh\ne\n \nn\ne\nx\nt\n \nb\no\no\nt\n \nc\ny\nc\nl\ne\n.\n \n \n \n.\n.\n.\n \n \n \n \nN\na\nt\nu\nr\na\nl\nl\ny\n,\n \ni\nt\n \nc\na\nn\nn\no\nt\n \nb\ne\n \ng\nu\na\nr\na\nn\nt\ne\ne\nd\n \nt\nh\na\nt\n \nt\nh\ne\n \nP\nI\nN\n \nc\na\nn\n \nb\ne\n \nk\ne\np\nt\n \ns\ne\nc\nr\ne\nt\n,\n \na\nn\nd\n \na\n \nm\no\nt\ni\nv\na\nt\ne\nd\n \na\nt\nt\na\nc\nk\ne\nr\n \nm\ni\ng\nh\nt\n \nv\ne\nr\ny\n \nw\ne\nl\nl\n \nb\ne\n \na\nb\nl\ne\n \nt\no\n \nl\ne\na\nr\nn\n \ni\nt\n \nt\nh\nr\no\nu\ng\nh\n \ns\ne\nv\ne\nr\na\nl\n \nm\ne\na\nn\ns\n.\n \n \n \n.\n.\n.\n \n \n \n \nA\nn\n \na\nt\nt\na\nc\nk\ne\nr\n \ni\nn\n \np\no\ns\ns\ne\ns\ns\ni\no\nn\n \no\nf\n \nt\nh\ne\n \nP\nI\nN\n \nc\na\nn\n \nc\na\nr\nr\ny\n \no\nu\nt\n \nt\nh\ne\n \ns\na\nm\ne\n \na\nt\nt\na\nc\nk\n \na\ns\n \nd\ne\ns\nc\nr\ni\nb\ne\nd\n \ni\nn\n \nt\nh\ne\n \np\nr\ne\nv\ni\no\nu\ns\n \ns\ne\nc\nt\ni\no\nn\n,\n \nw\ni\nt\nh\n \nt\nh\ne\n \no\nn\nl\ny\n \ne\nx\nc\ne\np\nt\ni\no\nn\n \nt\nh\na\nt\n \nt\nh\ne\ny\n \nh\na\nv\ne\n \nt\no\n \ne\nn\nt\ne\nr\n \nt\nh\ne\n \nP\nI\nN\n \nd\nu\nr\ni\nn\ng\n \nb\no\no\nt\n \nt\no\n \nr\ne\nl\ne\na\ns\ne\n \nt\nh\ne\n \nV\nM\nK\n.\n \n \n \n.\n.\n.\n \n \n \n \nD\ne\np\ne\nn\nd\ni\nn\ng\n \no\nn\n \nt\nh\ne\n \ne\nn\nv\ni\nr\no\nn\nm\ne\nn\nt\n \no\nr\n \nt\nh\ne\n \nt\ny\np\ne\n \no\nf\n \na\nd\nv\ne\nr\ns\na\nr\ny\n,\n \nt\nh\ne\n \nm\no\ns\nt\n \ns\ne\nc\nu\nr\ne\n \nB\ni\nt\nL\no\nc\nk\ne\nr\n \nc\no\nn\nf\ni\ng\nu\nr\na\nt\ni\no\nn\n \nm\ni\ng\nh\nt\n \nn\no\nt\n \no\nf\nf\ne\nr\n \na\nd\ne\nq\nu\na\nt\ne\n \np\nr\no\nt\ne\nc\nt\ni\no\nn\n.\n \n \n \n.\n.\n.\n \n \n "
    ],
    "html_url": "https://blog.compass-security.com/2024/02/microsoft-bitlocker-bypasses-are-practical/",
    "text": "My colleague Mirko and I recently attended the “Defeating Microsoft’s Default BitLocker Implementation” security training by Hands-On Security. The training was excellent and got us really excited about the topic. In just two days, Pascal Gujer and Joel Frei taught the group the skills and knowledge needed to bypass a default BitLocker configuration on a T470 ThinkPad. Importantly, these methods can be used on most modern business machines, not just this particular model.\n\nThe attack has also gained significant attention in the security community this year, with many blog articles being published and Youtube videos where BitLocker is bypassed in under a minute being released.\n\nIn this blog article, we would like to share key insights from the training and emphasize the potential risks and consequences associated with this attack technique. Our target audience includes businesses looking to safeguard sensitive data on their Windows devices, as well as individuals with an elevated requirement for protecting their data.\n\nBackground\n\nBitLocker is a disk encryption feature in Microsoft Windows operating systems that helps protect the confidentiality of the data on a computer by encrypting the hard drive. If a laptop is lost or stolen, an attacker who gains physical possession of the machine cannot access the data or tamper with the system, even when removing the disk and accessing it from another system. This prevents unauthorized data access as well as Evil Maid attacks where an attacker with (temporary) access to a device attempts to install a backdoor into the system.\n\nOn most modern business laptops (Lenovo ThinkPad, HP Elite Book, Microsoft Surface), the cryptographic key material to decrypt the disk during boot is stored in a Trusted Platform Module (TPM). A TPM is a hardware-based security chip that provides a secure tamper-resistant environment for storing key material and performing cryptographic operations.\n\nBitLocker Configuration\n\nBitLocker can be run in different modes:\n\nTPM-only: The operating system boots normally to the logon screen without any user interaction.\nPIN Protector: The user must provide a PIN during boot.\nStartup Key Protector: The user must provide a startup key (typically stored on a USB thumb drive) during boot.\n\nFor maximum security, the PIN and startup key protectors can be combined, such that the user must provide a PIN (knowledge factor) and a key file (possession factor) during boot. In our experience, virtually all customers have TPM-only mode configured on their Windows devices. On Windows 11 where BitLocker is enabled by default, TPM-only mode is used unless configured otherwise.\n\nBitLocker Architecture\n\nTo understand the attack and mitigations, it is important to have a solid understanding of some BitLocker implementation details.\n\nIn the TPM-only mode, the Volume Master Key (VMK) is released during boot and sent to the CPU. The CPU then fetches the encrypted Full Volume Encryption Key from the BitLocker partition metadata and decrypts it with the VMK to obtain the plaintext Full Volume Encryption Key. This is visualized in the image below:\n\n(Source: Microsoft documentation)\n\nIn other words, with access to the VMK and the encrypted BitLocker partition, the disk can be decrypted. It is worth emphasizing that the plaintext VMK is sent to the CPU over physical wires. This gives an attacker the opportunity to sniff the data channel and intercept the VMK. Given the VMK, the attacker can obtain the Full Volume Encryption Key and access the disk. Alternatively, since the recovery passphrase is stored encrypted under the VMK in the disk metadata, the recovery passphrase can be obtained once the VMK is known.\n\nWhile the image above only covers the TPM-only mode scenario, the following image shows the mechanism for other key protectors:\n\n(Source: Microsoft documentation)\n\nThe most common boot scenarios are briefly described below:\n\nTPM: In the TPM-only mode, the user is not required to provide a protector to unlock the TPM. During boot, the boot environment is measured, meaning that the firmware and software that is loaded is tracked and the measurement values are stored in the Platform Configuration Registers (PCR). The TPM only releases the key if the PCR values contain expected values. This guarantees that the key is only released if the authentic Windows operating system is booted. In particular, this prevents an attacker from booting another operating system and then mounting the disk, as the PCR registers would contain invalid values.\nTPM and PIN: The VMK is only released to the CPU after the user has provided the correct PIN. (The PCR values are checked as well, just as in the TPM-only mode.)\nTPM and Startup Key: The VMK is only released to the CPU after the user has provided the correct startup key. (The PCR values are checked as well, just as in the TPM-only mode.)\nAttack\n\nThis section outlines the steps involved in carrying out the attack. The goal is not focus on nitty gritty details, but rather demonstrate the feasibility of the attack. No esoteric techniques or expensive hardware that can only be found in an advanced lab is required. In fact, all these steps were carried out with equipment that costs less than 1000 CHF. The attack is thus very affordable. Depending on the target device, attacks with much cheaper hardware have been demonstrated.\n\nTPM Bus Sniffing\n\nThe goal of the attack is to sniff the communication between the TPM chip and the CPU. Business laptops usually feature a discrete TPM, i.e., a dedicated physical tamper resistant chip on the motherboard. There are other TPM types (integrated, firmware, software, virtual), for which the attack does not work.\n\nOn the ThinkPad T470, the TPM can be accessed by removing the back cover, which can be achieved by removing a few screws and prying open the back:\n\nThis process takes less than a minute or even mere seconds with some practice. The following picture shows the chip in more detail:\n\nAfter locating the TPM chip, the attacker solders cables onto the relevant PINs. In the case of the T470, the Serial Peripheral Interface (SPI) communication protocol is used. Therefore, an attacker needs to connect five cables:\n\nMOSI\nMISO\nChannel Select (CS)\nClock (CLK)\nGround\n\nThe TPM pins themselves are very small, making it difficult to solder a cable. Instead, one usually looks for larger components on the mother board (e.g., resistors, capacitors, debug ports, larger connected chips) that are connected to the same bus used by the TPM to communicate with the CPU. On the motherboard of the T470, the TPM is connected to a relatively large SPI flash controller. By soldering onto the respective pins, the SPI communication channels can be sniffed. The following picture shows the SPI flash controller chip and the soldered wires:\n\nThese wires were then connected to a DreamSourceLab logic analyzer (DSLogic U3Pro16) to sniff the bus communication:\n\nDSView can be used to record and analyze the recorded SPI TPM traffic. There is even a built-in decoder to search for the VMK in the recorded trace:\n\nAfterwards, the BitLocker recovery key can be obtained with the Sigrok BitLocker Key Extractor tool:\n\n$ bitlocker-recovery-password-decryptor.py 341ae1961c7ed7932568d294d3ab886a832e509f9dd4ebf1f70e85261bd07171 bitlocker-disk.img \n\n###############################################################################\n#                                                                             #         \n#                       BitLocker Recovery Password Decryptor                 #\n#                                                                             #\n# by Pascal Gujer (@pascal_gujer)                                        v1.1 #\n###############################################################################\n\nExtracting BitLocker key material with dislocker-metadata...\nParsing output...\n\nNonce:                  9019ee4ee24bda0103000000\nMAC:                    30ca25ab9ef248ba376aa3b909f656e0\nEncrypted Recovery Password: c6f012bf3b25eaa5cbcdf0e805e29199ce6a17275796f033beeb1a08\n\nVMK:                    341ae1961c7ed7932568d294d3ab886a832e509f9dd4ebf1f70e85261bd07171\n\nDecrypting recovery password...\nThe decrypted recovery password is authentic:\n1c000000010000000010000002c0057df57f9340902243c8c98a6038 \n\n[+] Sucessfully retrieved the BitLocker Recovery Password in human readable format: \n\n            540694-352055-360327-181841-097328-563937-390819-158752\n\n\nAt this point, the attacker can access all data stored on the disk and/or install backdoors (Evil Maid attack).\n\nMitigation\n\nThis section discusses various mitigation strategies as well as operational considerations that require attention in practice.\n\nPIN / Startup Key\n\nRecall from a previous section that the attack exploits the fact that in TPM-only mode the VMK is automatically released and sent to the CPU during boot, allowing the attacker to recover it by sniffing the bus communication.\n\nThe most secure approach to prevent the TPM from automatically releasing the key is configuring a PIN protector (a knowledge factor) or a startup key (a possession factor). If either of the two are configured, the VMK is not released until the protector is provided. An attacker without knowledge / possession of the protector thus cannot sniff the VMK during the boot process.\n\nFor maximum security, both a PIN protector and a startup key protector should be required. We have seen this setup work very well in practice.\n\nTamper Protection\n\nBusiness laptops often implement a tamper protection mechanism that attempts to detect hardware tampering, for example:\n\nLenovo ThinkShield Built in Platform Security (aka Tamper Switch)\nHP Tamper Lock\n\nThese tamper protection mechanisms are usually implemented with a physical switch that opens or closes a circuit when the backplate is removed. If tamper protection is detected, the system will either prompt the user for the BIOS password or the BitLocker recovery key during the next boot cycle.\n\nTamper protection can be enabled / disabled in the BIOS settings. A sample configuration is provided in the following screenshot:\n\nFrom a security perspective, prompting the user for the BitLocker recovery key is arguably slightly more secure than prompting for the BIOS password.\n\nHowever, it should be noted that a careful attacker who is aware of tamper protection switches can rather easily bypass this protection mechanism by dremeling holes to access the PINs instead of removing the entire back cover. Depending on the switch type, it may also be possible to unsolder it. Tamper protection should therefore not be considered a primary defense mechanism against TPM sniffing attacks.\n\nOperational Considerations\n\nWhilst PIN and startup key protectors, or preferably a combination thereof, provide strong technical protection against TPM bus sniffing attacks, there are some important operational considerations. Without proper processes, the security guarantees provided by BitLocker might be significantly diminished or the whole protection rendered ineffective.\n\nRecovery\n\nWhen BitLocker is enabled on a laptop, there is a need for a recovery process because users can potentially lose access to the system due to various reasons. For example, they may lose / forget their BitLocker encryption key or password, experience hardware failures that prevent normal booting, or encounter issues with system updates or configuration changes. In such cases, the system can be recovered through a BitLocker recovery key.\n\nIt is crucial that there is a robust process that ensures the recovery key is only handed out over a secure channel, and that the employee is authenticated. If a simple phone call to the IT support team suffices to obtain the recovery key, even the strongest security configuration can be bypassed easily.\n\nPIN Management\n\nIn practice, we have encountered setups where the same (simple) PIN was configured on a fleet of thousands of machines. These PINs are shared among all employees and are never rotated. Naturally, it cannot be guaranteed that the PIN can be kept secret, and a motivated attacker might very well be able to learn it through several means. An attacker in possession of the PIN can carry out the same attack as described in the previous section, with the only exception that they have to enter the PIN during boot to release the VMK.\n\nIt is therefore recommended that each machine is configured with a unique BitLocker PIN that is chosen by the employee during the initial setup of their hardware.\n\nStartup Key Storage\n\nThe key file is usually stored on a USB thumb drive and is not protected with any user authentication mechanism, such as a fingerprint reader. If the attacker can get a hold of the laptop and the USB thumb drive, they can again carry out the attack outlined in the previous section. The only difference is that they have to plug in the drive to boot the machine.\n\nExpectation Management\n\nWhen evaluating defense mechanisms, it is crucial to not only focus on the benefits but also be aware of the limitations. Depending on the environment or the type of adversary, the most secure BitLocker configuration might not offer adequate protection. This is probably best illustrated with one of my all-time favorite XKCDs:\n\n(Source: https://xkcd.com/538/)",
    "title": "Microsoft BitLocker Bypasses are Practical"
}
